In [1]:
%reload_ext sql

In [2]:
%%sql mysql+pymysql://root:MyN3wP4ssw0rd@localhost:3306/Data_bank

SELECT 1+1;

1 rows affected.

[(2,)]

# DATA BANK

## A 1: How many unique nodes are there on the Data Bank system?

In [4]:
%%sql 

SELECT Count(DISTINCT( node_id )) AS No_of_Nodes
FROM   customer_nodes

 * mysql+pymysql://root:***@localhost:3306/Data_bank
1 rows affected.

[(5,)]

## A 2: What is the number of nodes per region?

In [5]:
%%sql 

SELECT region_id,
       region_name,
       Count(node_id)
FROM   customer_nodes
       INNER JOIN regions using(region_id)
GROUP  BY region_id,
          region_name
ORDER  BY region_id

 * mysql+pymysql://root:***@localhost:3306/Data_bank
5 rows affected.

[(1, 'Australia', 770),
 (2, 'America', 735),
 (3, 'Africa', 714),
 (4, 'Asia', 665),
 (5, 'Europe', 616)]

## A 3:  How many customers are allocated to each region?

In [6]:
%%sql 

SELECT region_id,
       region_name,
       Count(DISTINCT( customer_id ))
FROM   customer_nodes
       INNER JOIN regions using(region_id)
GROUP  BY region_id,
          region_name
ORDER  BY region_id

 * mysql+pymysql://root:***@localhost:3306/Data_bank
5 rows affected.

[(1, 'Australia', 110),
 (2, 'America', 105),
 (3, 'Africa', 102),
 (4, 'Asia', 95),
 (5, 'Europe', 88)]

## A 4:  How many days on average are customers reallocated to a different node?

In [30]:
%%sql

SELECT Avg(Datediff(end_date, start_date)) AS relocated_days
FROM   customer_nodes
WHERE  Year(end_date) != 9999

 * mysql+pymysql://root:***@localhost:3306/Data_bank
   mysql+pymysql://root:***@localhost:3306/Foodie_fie
1 rows affected.

[(Decimal('14.6340'),)]

## A 5:  What is the median, 80th and 95th percentile for this same reallocation days metric for each region?

In [4]:
%%sql

WITH sub AS
(
       SELECT *,
              Abs( Datediff(start_date, end_date) ) AS relocated_days
       FROM   customer_nodes
       WHERE  Year(end_date)!= 9999), sub_2 AS
(
         SELECT   region_id,
                  relocated_days,
                  Percent_rank() OVER( partition BY region_id ORDER BY relocated_days )* 100 AS per_rank
         FROM     sub)
SELECT   region_id,
         Min(
         CASE
                  WHEN per_rank >= 50 THEN relocated_days
         END ) AS median,
         Min(
         CASE
                  WHEN per_rank >= 80 THEN relocated_days
         END ) AS 80th_percentile,
         min(
         CASE
                  WHEN per_rank >= 95 THEN relocated_days
         END ) AS 90th_percentile
FROM     sub_2
GROUP BY 1

 * mysql+pymysql://root:***@localhost:3306/Data_bank
5 rows affected.

[(1, 16, 24, 29),
 (2, 16, 24, 29),
 (3, 16, 25, 29),
 (4, 16, 24, 29),
 (5, 16, 25, 29)]

## B 1: What is the unique count and total amount for each transaction type?

In [7]:
%%sql

SELECT txn_type,
       Count(txn_type),
       Sum(txn_amount) AS total_amount
FROM   customer_transactions
GROUP  BY 1
ORDER  BY 2

 * mysql+pymysql://root:***@localhost:3306/Data_bank
3 rows affected.

[('withdrawal', 1580, Decimal('793003')),
 ('purchase', 1617, Decimal('806537')),
 ('deposit', 2671, Decimal('1359168'))]

## B 2: What is the average total historical deposit counts and amounts for all customers?

In [8]:
%%sql

WITH sub
     AS (SELECT customer_id,
                Count(txn_type) Deposit_count,
                Avg(txn_amount) avg_deposit
         FROM   customer_transactions
         WHERE  txn_type = "deposit"
         GROUP  BY 1
         ORDER  BY 1)
SELECT Ceil(Avg(deposit_count)) AS avg_deposit_count,
       Ceil(Avg(avg_deposit))   AS avg_deposit_amount
FROM   sub

 * mysql+pymysql://root:***@localhost:3306/Data_bank
1 rows affected.

[(Decimal('6'), 509)]

## B 3: For each month - how many Data Bank customers make more than 1 deposit and either 1 purchase or 1 withdrawal in a single month?

In [10]:
%%sql

WITH sub AS
(
         SELECT   Concat( Year(txn_date), '-', Month(txn_date) ) AS dates,
                  customer_id,
                  Sum(
                  CASE
                           WHEN txn_type = 'deposit' THEN 1
                  END ) AS deposit_count,
                  Sum(
                  CASE
                           WHEN txn_type = 'withdrawal' THEN 1
                  END ) AS withdrawal_count,
                  Sum(
                  CASE
                           WHEN txn_type = 'purchase' THEN 1
                  END ) AS purchase_count
         FROM     customer_transactions
         GROUP BY 1,
                  2
         ORDER BY 2 )
SELECT   dates,
         Count(*)
FROM     sub
WHERE    deposit_count > 1
AND      (
                  withdrawal_count = 1
         OR       purchase_count = 1 )
GROUP BY 1
ORDER BY 1 limit 50

 * mysql+pymysql://root:***@localhost:3306/Data_bank
4 rows affected.

[('2020-1', 115), ('2020-2', 108), ('2020-3', 113), ('2020-4', 50)]

## B 4: What is the closing balance for each customer at the end of the month?

In [3]:
 %%sql

WITH monthly_transaction
     AS (SELECT Concat(Year(txn_date), '-', Lpad(Month(txn_date), 2, '0')) AS
                month,
                customer_id,
                Sum(CASE
                      WHEN txn_type = 'deposit' THEN txn_amount
                      ELSE 0
                    END) - Sum(CASE
                                 WHEN txn_type = 'withdrawal' THEN txn_amount
                                 ELSE 0
                               END) - Sum(CASE
                                            WHEN txn_type = 'purchase' THEN
                                            txn_amount
                                            ELSE 0
                                          END)                             AS
                   monthly_value
         FROM   customer_transactions
         GROUP  BY 1,
                   2)
SELECT month,
       customer_id,
       Sum(monthly_value)
         OVER (
           partition BY customer_id
           ORDER BY month ) AS balance_at_month_end
FROM   monthly_transaction
GROUP  BY 1,
          2
ORDER  BY 2 limit 5;

 * mysql+pymysql://root:***@localhost:3306/Data_bank
5 rows affected.

[('2020-01', 1, Decimal('312')),
 ('2020-03', 1, Decimal('-640')),
 ('2020-01', 2, Decimal('549')),
 ('2020-03', 2, Decimal('610')),
 ('2020-01', 3, Decimal('144'))]

In [4]:
%%sql

 WITH sub AS
(
         SELECT   Concat( Year(txn_date), '-', Month(txn_date) ) AS dates,
                  customer_id,
                  Sum( If( txn_type = 'deposit', txn_amount,- txn_amount ) ) AS type_transactions
         FROM     customer_transactions
         GROUP BY 1,
                  2
         ORDER BY 2 )
SELECT   dates,
         customer_id,
         Sum(type_transactions) OVER( partition BY customer_id ORDER BY dates ) AS month_transaction
FROM     sub limit 5;

 * mysql+pymysql://root:***@localhost:3306/Data_bank
5 rows affected.

[('2020-1', 1, Decimal('312')),
 ('2020-3', 1, Decimal('-640')),
 ('2020-1', 2, Decimal('549')),
 ('2020-3', 2, Decimal('610')),
 ('2020-1', 3, Decimal('144'))]

## B 5: What is the percentage of customers who increase their closing balance by more than 5%?

In [39]:
%%sql

WITH sub
     AS (SELECT Concat(Year(txn_date), '-', Month(txn_date))           AS dates,
                customer_id,
                Sum(If(txn_type = 'deposit', txn_amount, -txn_amount)) AS
                   type_transactions
         FROM   customer_transactions
         GROUP  BY 1,
                   2
         ORDER  BY 2),
     sub_2
     AS (SELECT dates,
                customer_id,
                Sum(type_transactions)
                  OVER(
                    partition BY customer_id
                    ORDER BY dates) AS month_transaction
         FROM   sub
         ORDER  BY 2,
                   1),
     sub_3
     AS (SELECT *,
                Max(dates)
                  OVER(
                    partition BY customer_id) AS max_date,
                Min(dates)
                  OVER(
                    partition BY customer_id) AS min_date
         FROM   sub_2),
     sub_4
     AS (SELECT customer_id,
                ( Sum(CASE
                        WHEN max_date = dates THEN month_transaction
                      END) - Sum(CASE
                                   WHEN min_date = dates THEN month_transaction
                                 END) ) * 100 / Sum(CASE
                WHEN min_date = dates THEN month_transaction
                                                    END) AS
                   month_transaction_more_than_5
         FROM   sub_3
         GROUP  BY 1)
SELECT Count(*) AS customer_count
FROM   sub_4
WHERE  month_transaction_more_than_5 > 5

 * mysql+pymysql://root:***@localhost:3306/Data_bank
1 rows affected.

[(221,)]